nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt685audevk/common/pin_mux/pin_mux.h
/*! @name FLEXSPI0A_DATA0 (coord T5), U108[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_D0_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_D0_SIGNAL FLEXSPI_A_DATA0   /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI0A_DATA1 (coord U5), U108[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_D1_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_D1_SIGNAL FLEXSPI_A_DATA1   /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI0A_DATA2 (coord P6), U108[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_D2_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_D2_SIGNAL FLEXSPI_A_DATA2   /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI0A_DATA3 (coord P7), U108[D4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_D3_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_D3_SIGNAL FLEXSPI_A_DATA3   /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI0A_DATA4 (coord T7), U108[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_D4_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_D4_SIGNAL FLEXSPI_A_DATA4   /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI0A_DATA5 (coord U7), U108[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_D5_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_D5_SIGNAL FLEXSPI_A_DATA5   /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI0A_DATA6 (coord R7), U108[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_D6_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_D6_SIGNAL FLEXSPI_A_DATA6   /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI0A_DATA7 (coord T8), U108[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_D7_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_D7_SIGNAL FLEXSPI_A_DATA7   /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI0A_DQS (coord U9), U108[C3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_DQS_PERIPHERAL FLEXSPI     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_DQS_SIGNAL FLEXSPI_A_DQS   /*!<@brief Signal name */
                                                            /* @} */

/*! @name FLEXSPI0A_SCLK (coord T9), U108[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_CLK0_PERIPHERAL FLEXSPI      /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_CLK0_SIGNAL FLEXSPI_A_SCLK   /*!<@brief Signal name */
                                                              /* @} */

/*! @name FLEXSPI0A_SS0_N (coord T4), U108[A3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_OSPI_SSEL0_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_OSPI_SSEL0_SIGNAL FLEXSPI_A_SS0_B   /*!<@brief Signal name */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPSRAMPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name SD0_D0 (coord R11), J32[7]/SD_DAT0
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_DAT0_PERIPHERAL USDHC0      /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_DAT0_SIGNAL USDHC_DATA      /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD_DAT0_CHANNEL 0              /*!<@brief Signal channel */
                                                          /* @} */

/*! @name SD0_D1 (coord T11), J32[8]/SD_DAT1
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_DAT1_PERIPHERAL USDHC0      /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_DAT1_SIGNAL USDHC_DATA      /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD_DAT1_CHANNEL 1              /*!<@brief Signal channel */
                                                          /* @} */

/*! @name SD0_D2 (coord U11), J32[9]/SD_DAT2
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_DAT2_PERIPHERAL USDHC0      /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_DAT2_SIGNAL USDHC_DATA      /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD_DAT2_CHANNEL 2              /*!<@brief Signal channel */
                                                          /* @} */

/*! @name SD0_D3 (coord T12), J32[1]/SD_DAT3
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_DAT3_PERIPHERAL USDHC0      /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_DAT3_SIGNAL USDHC_DATA      /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD_DAT3_CHANNEL 3              /*!<@brief Signal channel */
                                                          /* @} */

/*! @name SD0_CLK (coord P10), J32[5]/SD_CLK
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_CLK_PERIPHERAL USDHC0     /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_CLK_SIGNAL USDHC_CLK      /*!<@brief Signal name */
                                                        /* @} */

/*! @name SD0_CMD (coord R9), J32[2]/SD_CMD
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_CMD_PERIPHERAL USDHC0     /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_CMD_SIGNAL USDHC_CMD      /*!<@brief Signal name */
                                                        /* @} */

/*! @name SD0_CARD_DET_N (coord R13), J32[10]/SD_CD
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_CD_PERIPHERAL USDHC0       /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_CD_SIGNAL USDHC_CD_B       /*!<@brief Signal name */
                                                         /* @} */

/*! @name PIO2_10 (coord T15), U23[3]/SD_RST_N
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_RST_N_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_RST_N_SIGNAL PIO2               /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD_RST_N_CHANNEL 10                /*!<@brief Signal channel */

